superMarioRun/app/controllers/pages_controller.rb

  def home
  	# raise 'current_user'
	  	coins_array = current_user.locations.select { |location| location.coin == true }
	  	@total_coins = coins_array.length

	  	# distance_sum = 0
	  	# current_user.locations.each {|location| distance_sum += location.distance_from_last }
	  	@total_distance = current_user.distance_sum.round(2)

	  	run_time = 0
	  	current_user.runs.each {|run|
	  		if run.locations.length > 0
---
SELECT "locations".* FROM "locations" INNER JOIN "runs" ON "locations"."run_id" = "runs"."id" WHERE "runs"."user_id" = $1
SELECT "runs".* FROM "runs"  WHERE "runs"."user_id" = $1
SELECT "locations".* FROM "locations"  WHERE "locations"."run_id" = $1